qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32F3XX/stm32f30x_tim.c
/**
  ******************************************************************************
  * @file    stm32f30x_tim.c
  * @author  MCD Application Team
  * @version V1.1.0
  * @date    27-February-2014
  * @brief   This file provides firmware functions to manage the following 
  *          functionalities of the TIM peripheral:
  *            + TimeBase management
  *            + Output Compare management
  *            + Input Capture management
  *            + Advanced-control timers (TIM1 and TIM8) specific features  
  *            + Interrupts, DMA and flags management
  *            + Clocks management
  *            + Synchronization management
  *            + Specific interface management
  *            + Specific remapping management      
  *              
  @verbatim
    
  ==============================================================================
                       ##### How to use this driver #####
  ==============================================================================
   [..] This driver provides functions to configure and program the TIM 
        of all stm32f30x devices.
        These functions are split in 9 groups: 
     
        (#) TIM TimeBase management: this group includes all needed functions 
            to configure the TM Timebase unit:
                 (++) Set/Get Prescaler
                 (++) Set/Get Autoreload  
                 (++) Counter modes configuration
                 (++) Set Clock division  
                 (++) Select the One Pulse mode
                 (++) Update Request Configuration
                 (++) Update Disable Configuration
                 (++) Auto-Preload Configuration 
                 (++) Enable/Disable the counter     
                   
       (#) TIM Output Compare management: this group includes all needed 
           functions to configure the Capture/Compare unit used in Output 
           compare mode: 
                 (++) Configure each channel, independently, in Output Compare mode
                 (++) Select the output compare modes
                 (++) Select the Polarities of each channel
                 (++) Set/Get the Capture/Compare register values
                 (++) Select the Output Compare Fast mode 
                 (++) Select the Output Compare Forced mode  
                 (++) Output Compare-Preload Configuration 
                 (++) Clear Output Compare Reference
                 (++) Select the OCREF Clear signal
                 (++) Enable/Disable the Capture/Compare Channels    
                    
        (#) TIM Input Capture management: this group includes all needed 
            functions to configure the Capture/Compare unit used in 
            Input Capture mode:
                 (++) Configure each channel in input capture mode
                 (++) Configure Channel1/2 in PWM Input mode
                 (++) Set the Input Capture Prescaler
                 (++) Get the Capture/Compare values      
                     
        (#) Advanced-control timers (TIM1 and TIM8) specific features
                 (++) Configures the Break input, dead time, Lock level, the OSSI,
                      the OSSR State and the AOE(automatic output enable)
                 (++) Enable/Disable the TIM peripheral Main Outputs
                 (++) Select the Commutation event
                 (++) Set/Reset the Capture Compare Preload Control bit
                               
        (#) TIM interrupts, DMA and flags management
                 (++) Enable/Disable interrupt sources
                 (++) Get flags status
                 (++) Clear flags/ Pending bits
                 (++) Enable/Disable DMA requests 
                 (++) Configure DMA burst mode
                 (++) Select CaptureCompare DMA request  
                
        (#) TIM clocks management: this group includes all needed functions 
            to configure the clock controller unit:
                 (++) Select internal/External clock
                 (++) Select the external clock mode: ETR(Mode1/Mode2), TIx or ITRx
         
        (#) TIM synchronization management: this group includes all needed 
            functions to configure the Synchronization unit:
                 (++) Select Input Trigger  
                 (++) Select Output Trigger  
                 (++) Select Master Slave Mode 
                 (++) ETR Configuration when used as external trigger   
       
        (#) TIM specific interface management, this group includes all 
            needed functions to use the specific TIM interface:
                 (++) Encoder Interface Configuration
                 (++) Select Hall Sensor   
           
        (#) TIM specific remapping management includes the Remapping 
            configuration of specific timers               
     
  @endverbatim
      
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2014 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f30x_tim.h"
#include "stm32f30x_rcc.h"

/** @addtogroup STM32F30x_StdPeriph_Driver
  * @{
  */

